export const normalSuffix = [
  'だぞっ',
  'だぜ',
  'だよ',
  'っす',
  'っすわ',
  'でございます',
  'なのだ',
  'です',
  'なのですよ',
  'なんだな',
  'なのよな',
  'であーる',
  'ですね',
  'だよ',
  'なんだなぁ',
  'です！',
  'なのだ',
  'ですねぇ',
  'です～',
];

export const animeSuffix = [
  'ザマス', // スネ夫のママ （ドラえもん）
  'じゃん', // カンクロウ ( NARUTO )
  'ってばよ', // うずまきナルト ( NARUTO )
  'DA☆', //
  'デース', // ペガサス・J・クロフォード （ 遊☆戯☆王 ）
  'だーね', // 柳沢慎也 （テニスの王子様）
  'だわさ', // ピノコ （ブラック・ジャック）
  'でさァ', // 沖田総悟 （銀魂）
  'ですぜィ', // 沖田総悟 （銀魂）
  'ですの', // 白井黒子 （とある魔術の禁書目録）
  'ナリ', // コロ助 （キテレツ大百科）
  'づら', // 殿馬一人 （ドカベン）
];

export const gameSuffix = [
  'だなも', // たぬきち（どうぶつの森）
  'でやんす' // 矢部明雄 （実況パワフルプロ野球）
];

export const netSuffix = [
  'クマー',
  'だお',
  'ダヨー', // ミクダヨー
];

export const suffix = [
  ...normalSuffix,
  ...animeSuffix,
  ...gameSuffix,
  ...netSuffix,
];

export default suffix;
